DataProcessors/омг_РасчетФактаПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>омг_РасчетФактаПоказателей</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТЗДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МедицинскийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипУслуги</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезСкидок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЗПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипУслуги</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МедицинскийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/омг_ПоказателиДляМонитораРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ПоказателиДляМонитораРуководителя</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МедицинскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЧековККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияЧековККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧекиПробиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЧастичноПробиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиНеПробиты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/омг_РасчетФактаПоказателей/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Период = НачалоМесяца(ТекущаяДата());
	ПоВсейГруппеКомпаний = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Попытка
		Период = НачалоМесяца(ДобавитьМесяц(Период, Направление));
	Исключение
	КонецПопытки;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Период = НачалоМесяца(Период);
	
КонецПроцедуры 

&НаКлиенте
Процедура АктуализироватьДанные(Команда)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные()
	ГруппаЛабУслуг = ПолучитьГруппуЛабораторныхУслуг(); 
	ПолучитьДанныеДляДашбоарда(ГруппаЛабУслуг);
КонецПроцедуры


&НаСервере
Функция ПолучитьГруппуЛабораторныхУслуг()
	Возврат Константы.омг_ГруппаЛабораторныхИсследований.Получить();
КонецФункции

&НаСервере
Процедура ПолучитьДанныеДляДашбоарда(ГруппаЛабУслуг) Экспорт
	
	ПериодС = Период;
	ПериодПо = КонецМесяца(Период);
	
	ЧекНеПробит = Перечисления.СостоянияЧековККМ.ЧекиНеПробиты;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Продажи.Филиал КАК Филиал,
	               |	Филиалы.Организация КАК Организация,
	               |	Продажи.Сумма КАК Сумма,
	               |	Продажи.СуммаБезСкидок КАК СуммаБезСкидок,
	               |	Продажи.Количество КАК Количество,
	               |	ВЫБОР
	               |		КОГДА Продажи.Номенклатура В ИЕРАРХИИ (&ГруппаЛИС)
	               |			ТОГДА ""Лабораторные услуги""
	               |		ИНАЧЕ ""Медицинские услуги""
	               |	КОНЕЦ КАК ТипУслуги,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ДокРегистратор.омг_СтраховаяПрограмма.Код, """") = """"
	               |				И ДокРегистратор.СостояниеЧековККМ <> &СостояниеНЕПробиты
	               |			ТОГДА ""Платные""
	               |		КОГДА ДокРегистратор.омг_СтраховаяПрограмма <> """"
	               |			ТОГДА ""ГОБМП""
	               |		ИНАЧЕ ""Неопределен""
	               |	КОНЕЦ КАК ТипОплаты,
	               |	ДокРегистратор.СостояниеЧековККМ КАК СостояниеЧековККМ,
	               |	ДокРегистратор.омг_СтраховаяПрограмма КАК омг_СтраховаяПрограмма,
	               |	Продажи.Клиент КАК Клиент,
	               |	Продажи.Сотрудник КАК Сотрудник,
	               |	Продажи.Номенклатура КАК Номенклатура,
	               |	ДокРегистратор.Ссылка КАК Ссылка,
	               |	Продажи.Период КАК Период,
	               |	Продажи.Клиент.омг_ПостоянныйКлиент КАК ПостоянныйКлиент
	               |ИЗ
	               |	РегистрНакопления.Продажи КАК Продажи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Филиалы КАК Филиалы
	               |		ПО Продажи.Филиал = Филиалы.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг КАК ДокРегистратор
	               |		ПО Продажи.Регистратор.Ссылка = ДокРегистратор.Ссылка
	               |ГДЕ
	               |	Продажи.Период МЕЖДУ &ПериодС И &ПериодПо
	               |	И (&ПоВсейГруппеКомпаний
	               |			ИЛИ НЕ &ПоВсейГруппеКомпаний
	               |				И &ФилиалОрганизация ЕСТЬ NULL
	               |				И &МедицинскийЦентр ЕСТЬ NULL
	               |			ИЛИ НЕ &ПоВсейГруппеКомпаний
	               |				И Филиалы.Организация = &ФилиалОрганизация
	               |			ИЛИ НЕ &ПоВсейГруппеКомпаний
	               |				И Продажи.Филиал = &МедицинскийЦентр)";
	Запрос.УстановитьПараметр("ПериодС", ПериодС);
	Запрос.УстановитьПараметр("ПериодПо", ПериодПо);
	Запрос.УстановитьПараметр("ФилиалОрганизация", Филиал);
	Запрос.УстановитьПараметр("МедицинскийЦентр", МедицинскийЦентр);
	Запрос.УстановитьПараметр("ПоВсейГруппеКомпаний", ПоВсейГруппеКомпаний);
	Запрос.УстановитьПараметр("ГруппаЛИС", ГруппаЛабУслуг);  
	Запрос.УстановитьПараметр("СостояниеНЕПробиты", ЧекНеПробит);
	РезультатЗапроса = Запрос.Выполнить();
	//ТЗРезультат = Новый ТаблицаЗначений;
	//ТЗРезультат.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	//ТЗРезультат.Колонки.Добавить("МедицинскийЦентр", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	//ТЗРезультат.Колонки.Добавить("ТипУслуги", Новый ОписаниеТипов("Строка"));
	//ТЗРезультат.Колонки.Добавить("ТипОплаты", Новый ОписаниеТипов("Строка"));
	//КолонкаСумма = ТЗРезультат.Колонки.Добавить("Сумма");
	//КолонкаСумма.ТипЗначения = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2));
	// 
	//КолонкаСуммаБезСкидок = ТЗРезультат.Колонки.Добавить("СуммаБезСкидок");
	//КолонкаСуммаБезСкидок.ТипЗначения = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2));
	
	//КолонкаКоличество = ТЗРезультат.Колонки.Добавить("Количество");
	//КолонкаКоличество.ТипЗначения = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 3));    
	Выборка = РезультатЗапроса.Выбрать();
	ТЗДанные.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗДанные.Добавить();
		НоваяСтрока.Организация = Выборка.Организация;
		НоваяСтрока.МедицинскийЦентр = Выборка.Филиал;
		НоваяСтрока.ТипУслуги = Выборка.ТипУслуги;
		НоваяСтрока.ТипОплаты = Выборка.ТипОплаты;
		НоваяСтрока.Сумма = Выборка.Сумма;
		НоваяСтрока.СуммаБезСкидок = Выборка.СуммаБезСкидок;
		НоваяСтрока.Количество = Выборка.Количество;
		НоваяСтрока.Документ = Выборка.Ссылка;
		НоваяСтрока.Период = Выборка.Период;
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Клиент = Выборка.Клиент; 
		НоваяСтрока.ПостоянныйКлиент = Выборка.ПостоянныйКлиент;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьПоказатели(Команда)
	ТЗПоказатели.Очистить();
	      
	РассчитатьСредниеЧеки();
	РассчитатьДоходы();
	РассчитатьКоличествоУникальныхПациентов();  
	РассчитатьКоличествоПосещений();
	РассчитатьКоличествоПостоянныхПациентов();
	РассчитатьПроцентПовторныхПосещений();        
    РассчитатьПроцентПостоянныхКлиентов();
	РассчитатьКоличествоПриемов();
	РассчитатьКоличествоНовыхКлиентов();
КонецПроцедуры





&НаКлиенте
Процедура РассчитатьСредниеЧеки()
    
    ОбщийСреднийЧек = РассчитатьСреднийЧекПоФильтрам(Новый Массив);
	ПоказательСреднийЧек = ОпределитьПоказатель ("Средний чек");
    ДобавитьПоказатель(ПоказательСреднийЧек, "Общий", , , , , ОбщийСреднийЧек);
    
    РассчитатьВсеРазрезыСреднегоЧека(ПоказательСреднийЧек);
    
КонецПроцедуры


&НаСервере
Функция ОпределитьПоказатель(ТипПоказателя)
	Если ТипПоказателя = "Средний чек" Тогда
		Показатель = Справочники.ПоказателиПланирования.СреднийЧек;
	ИначеЕсли ТипПоказателя = "Доход" Тогда
		Показатель = Справочники.ПоказателиПланирования.Доход;
	ИначеЕсли ТипПоказателя = "Количество уникальных пациентов" Тогда
		Показатель = Справочники.ПоказателиПланирования.КоличествоУникальныхПациентов;
	ИначеЕсли ТипПоказателя = "Количество посещений" Тогда
		Показатель = Справочники.ПоказателиПланирования.КоличествоВизитов;		
	ИначеЕсли ТипПоказателя = "Количество постоянных пациентов" Тогда
		Показатель = Справочники.ПоказателиПланирования.КоличествоПостоянныхПациентов;
	ИначеЕсли ТипПоказателя = "Процент повторных посещений" Тогда          
        Показатель = Справочники.ПоказателиПланирования.ПроцентПовторныхПосещений;
    ИначеЕсли ТипПоказателя = "Процент постоянных клиентов" Тогда          
        Показатель = Справочники.ПоказателиПланирования.ПроцентПостоянныхКлиентов;
	ИначеЕсли ТипПоказателя = "Количество первичных приемов" Тогда
        Показатель = Справочники.ПоказателиПланирования.КоличествоПервичныхПриемов;
    ИначеЕсли ТипПоказателя = "Количество повторных приемов" Тогда
        Показатель = Справочники.ПоказателиПланирования.КоличествоПовторныхПриемов;
	ИначеЕсли ТипПоказателя = "Количество новых клиентов" Тогда
        Показатель = Справочники.ПоказателиПланирования.КоличествоНовыхПациентов;
	КонецЕсли;
	
	Возврат Показатель;
		
        
КонецФункции


&НаКлиенте
Процедура РассчитатьВсеРазрезыСреднегоЧека(ПоказательСреднийЧек)
    
    Организации = ПолучитьУникальныеЗначения("Организация");
    МедЦентры = ПолучитьУникальныеЗначения("МедицинскийЦентр");
    СоответствиеМедЦентрОрганизация = ПолучитьСоответствиеМедЦентрОрганизация();
    
    ТипыУслуг = Новый Массив;
    ТипыУслуг.Добавить("Лабораторные услуги");
    ТипыУслуг.Добавить("Медицинские услуги");
    
    ТипыОплат = Новый Массив;
    ТипыОплат.Добавить("ГОБМП");
    ТипыОплат.Добавить("Платные");
    
    РассчитатьБазовыеРазрезы(ПоказательСреднийЧек, ТипыУслуг, ТипыОплат);
    
    РассчитатьРазрезыПоОрганизациям(ПоказательСреднийЧек, Организации, ТипыУслуг, ТипыОплат);
    
    РассчитатьРазрезыПоМедЦентрам(ПоказательСреднийЧек, МедЦентры, СоответствиеМедЦентрОрганизация, ТипыУслуг, ТипыОплат);
    
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьБазовыеРазрезы(ПоказательСреднийЧек, ТипыУслуг, ТипыОплат)
    Для Каждого ТипУслуги Из ТипыУслуг Цикл
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипУслуги", ТипУслуги));
        
        СреднийЧек = РассчитатьСреднийЧекПоФильтрам(Фильтр);
		
        ДобавитьПоказатель(ПоказательСреднийЧек, "По типам услуг", ТипУслуги, , , , СреднийЧек);
    КонецЦикла;
    
    Для Каждого ТипУслуги Из ТипыУслуг Цикл
        Для Каждого ТипОплаты Из ТипыОплат Цикл
            Фильтр = Новый Массив;
            Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипУслуги", ТипУслуги));
            Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипОплаты", ТипОплаты));
            
            СреднийЧек = РассчитатьСреднийЧекПоФильтрам(Фильтр);
            ДобавитьПоказатель(ПоказательСреднийЧек, "По типам оплат и услуг", ТипУслуги, ТипОплаты, , , СреднийЧек);
        КонецЦикла;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРазрезыПоОрганизациям(ПоказательСреднийЧек, Организации, ТипыУслуг, ТипыОплат)
    Для Каждого Элемент Из Организации Цикл
        Организация = Элемент.Ключ;
        
        // Только организация
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
        СреднийЧек = РассчитатьСреднийЧекПоФильтрам(Фильтр);
		
        ДобавитьПоказатель(ПоказательСреднийЧек, "По организациям", , , Организация, , СреднийЧек);
        
        // Организация + тип услуги
        Для Каждого ТипУслуги Из ТипыУслуг Цикл
            Фильтр = Новый Массив;
            Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
            Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипУслуги", ТипУслуги));
            
            СреднийЧек = РассчитатьСреднийЧекПоФильтрам(Фильтр);
            ДобавитьПоказатель(ПоказательСреднийЧек, "По организациям и типам услуг", ТипУслуги, , Организация, , СреднийЧек);
        КонецЦикла;
        
        // Организация + тип услуги + тип оплаты
        Для Каждого ТипУслуги Из ТипыУслуг Цикл
            Для Каждого ТипОплаты Из ТипыОплат Цикл
                Фильтр = Новый Массив;
                Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
                Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипУслуги", ТипУслуги));
                Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипОплаты", ТипОплаты));
                
                СреднийЧек = РассчитатьСреднийЧекПоФильтрам(Фильтр);
                ДобавитьПоказатель(ПоказательСреднийЧек, "По организациям, типам услуг и оплат", ТипУслуги, ТипОплаты, Организация, , СреднийЧек);
            КонецЦикла;
        КонецЦикла;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРазрезыПоМедЦентрам(ПоказательСреднийЧек, МедЦентры, СоответствиеМедЦентрОрганизация, ТипыУслуг, ТипыОплат)
    Для Каждого Элемент Из МедЦентры Цикл
        МедЦентр = Элемент.Ключ;
        Организация = СоответствиеМедЦентрОрганизация.Получить(МедЦентр);
        
        // Только мед. центр
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
        СреднийЧек = РассчитатьСреднийЧекПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательСреднийЧек, "По мед. центрам", , , Организация, МедЦентр, СреднийЧек);
        
        // Мед. центр + тип услуги
        Для Каждого ТипУслуги Из ТипыУслуг Цикл
            Фильтр = Новый Массив;
            Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
            Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипУслуги", ТипУслуги));
            
            СреднийЧек = РассчитатьСреднийЧекПоФильтрам(Фильтр);
            ДобавитьПоказатель(ПоказательСреднийЧек, "По мед. центрам и типам услуг", ТипУслуги, , Организация, МедЦентр, СреднийЧек);
        КонецЦикла;
        
        // Мед. центр + тип услуги + тип оплаты
        Для Каждого ТипУслуги Из ТипыУслуг Цикл
            Для Каждого ТипОплаты Из ТипыОплат Цикл
                Фильтр = Новый Массив;
                Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
                Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипУслуги", ТипУслуги));
                Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипОплаты", ТипОплаты));
                
                СреднийЧек = РассчитатьСреднийЧекПоФильтрам(Фильтр);
                ДобавитьПоказатель(ПоказательСреднийЧек, "По мед. центрам, типам услуг и оплат", ТипУслуги, ТипОплаты, Организация, МедЦентр, СреднийЧек);
            КонецЦикла;
        КонецЦикла;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Функция РассчитатьСреднийЧекПоФильтрам(УсловияФильтрации)
    
    ОбщаяСумма = 0;
    УникальныеВизиты = Новый Соответствие;
    
    Для Каждого Строка Из ТЗДанные Цикл
        СоответствуетФильтру = Истина;
        
        Для Каждого Условие Из УсловияФильтрации Цикл
            Если Строка[Условие.Колонка] <> Условие.Значение Тогда
                СоответствуетФильтру = Ложь;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        Если СоответствуетФильтру Тогда
            ОбщаяСумма = ОбщаяСумма + Строка.Сумма;
            КлючВизита = Строка(Строка.Клиент) + "|" + Формат(Строка.Период, "ДФ=dd.MM.yyyy");
            УникальныеВизиты[КлючВизита] = Истина;
        КонецЕсли;
    КонецЦикла;
    
    КоличествоВизитов = УникальныеВизиты.Количество();
    
    Если КоличествоВизитов > 0 Тогда
        Возврат ОбщаяСумма / КоличествоВизитов;
    Иначе
        Возврат 0;
    КонецЕсли;
    
КонецФункции

&НаКлиенте
Процедура РассчитатьДоходы()
    
    ОбщийДоход = РассчитатьДоходПоФильтрам(Новый Массив);
	ПоказательДоход = ОпределитьПоказатель ("Доход");
    ДобавитьПоказатель(ПоказательДоход, "Общий", , , , , ОбщийДоход);
    
    РассчитатьВсеРазрезыДохода(ПоказательДоход);
    
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВсеРазрезыДохода(ПоказательДоход)
    
    Организации = ПолучитьУникальныеЗначения("Организация");
    МедЦентры = ПолучитьУникальныеЗначения("МедицинскийЦентр");
    СоответствиеМедЦентрОрганизация = ПолучитьСоответствиеМедЦентрОрганизация();
    
    ТипыУслуг = Новый Массив;
    ТипыУслуг.Добавить("Лабораторные услуги");
    ТипыУслуг.Добавить("Медицинские услуги");
    
    ТипыОплат = Новый Массив;
    ТипыОплат.Добавить("ГОБМП");
    ТипыОплат.Добавить("Платные");
    
    // 1. Расчеты доходов без привязки к организациям/медцентрам
    РассчитатьБазовыеРазрезыДохода(ПоказательДоход, ТипыУслуг, ТипыОплат);
    
    // 2. Расчеты доходов по организациям
    РассчитатьРазрезыДоходаПоОрганизациям(ПоказательДоход, Организации, ТипыУслуг, ТипыОплат);
    
    // 3. Расчеты доходов по мед. центрам
    РассчитатьРазрезыДоходаПоМедЦентрам(ПоказательДоход, МедЦентры, СоответствиеМедЦентрОрганизация, ТипыУслуг, ТипыОплат);
    
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьБазовыеРазрезыДохода(ПоказательДоход, ТипыУслуг, ТипыОплат)
    
    // По типам услуг
    Для Каждого ТипУслуги Из ТипыУслуг Цикл
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипУслуги", ТипУслуги));
        
        Доход = РассчитатьДоходПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательДоход, "По типам услуг", ТипУслуги, , , , Доход);
    КонецЦикла;
    
    // По типам оплат и услуг
    Для Каждого ТипУслуги Из ТипыУслуг Цикл
        Для Каждого ТипОплаты Из ТипыОплат Цикл
            Фильтр = Новый Массив;
            Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипУслуги", ТипУслуги));
            Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипОплаты", ТипОплаты));
            
            Доход = РассчитатьДоходПоФильтрам(Фильтр);
            ДобавитьПоказатель(ПоказательДоход, "По типам оплат и услуг", ТипУслуги, ТипОплаты, , , Доход);
        КонецЦикла;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРазрезыДоходаПоОрганизациям(ПоказательДоход, Организации, ТипыУслуг, ТипыОплат)
    
    Для Каждого Элемент Из Организации Цикл
        Организация = Элемент.Ключ;
        
        // Только организация
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
        Доход = РассчитатьДоходПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательДоход, "По организациям", , , Организация, , Доход);
        
        // Организация + тип услуги
        Для Каждого ТипУслуги Из ТипыУслуг Цикл
            Фильтр = Новый Массив;
            Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
            Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипУслуги", ТипУслуги));
            
            Доход = РассчитатьДоходПоФильтрам(Фильтр);
            ДобавитьПоказатель(ПоказательДоход, "По организациям и типам услуг", ТипУслуги, , Организация, , Доход);
        КонецЦикла;
        
        // Организация + тип услуги + тип оплаты
        Для Каждого ТипУслуги Из ТипыУслуг Цикл
            Для Каждого ТипОплаты Из ТипыОплат Цикл
                Фильтр = Новый Массив;
                Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
                Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипУслуги", ТипУслуги));
                Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипОплаты", ТипОплаты));
                
                Доход = РассчитатьДоходПоФильтрам(Фильтр);
                ДобавитьПоказатель(ПоказательДоход, "По организациям, типам услуг и оплат", ТипУслуги, ТипОплаты, Организация, , Доход);
            КонецЦикла;
        КонецЦикла;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРазрезыДоходаПоМедЦентрам(ПоказательДоход, МедЦентры, СоответствиеМедЦентрОрганизация, ТипыУслуг, ТипыОплат)
    
    Для Каждого Элемент Из МедЦентры Цикл
        МедЦентр = Элемент.Ключ;
        Организация = СоответствиеМедЦентрОрганизация.Получить(МедЦентр);
        
        // Только мед. центр
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
        Доход = РассчитатьДоходПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательДоход, "По мед. центрам", , , Организация, МедЦентр, Доход);
        
        // Мед. центр + тип услуги
        Для Каждого ТипУслуги Из ТипыУслуг Цикл
            Фильтр = Новый Массив;
            Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
            Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипУслуги", ТипУслуги));
            
            Доход = РассчитатьДоходПоФильтрам(Фильтр);
            ДобавитьПоказатель(ПоказательДоход, "По мед. центрам и типам услуг", ТипУслуги, , Организация, МедЦентр, Доход);
        КонецЦикла;
        
        // Мед. центр + тип услуги + тип оплаты
        Для Каждого ТипУслуги Из ТипыУслуг Цикл
            Для Каждого ТипОплаты Из ТипыОплат Цикл
                Фильтр = Новый Массив;
                Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
                Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипУслуги", ТипУслуги));
                Фильтр.Добавить(Новый Структура("Колонка, Значение", "ТипОплаты", ТипОплаты));
                
                Доход = РассчитатьДоходПоФильтрам(Фильтр);
                ДобавитьПоказатель(ПоказательДоход, "По мед. центрам, типам услуг и оплат", ТипУслуги, ТипОплаты, Организация, МедЦентр, Доход);
            КонецЦикла;
        КонецЦикла;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Функция РассчитатьДоходПоФильтрам(УсловияФильтрации)
    
    ОбщаяСумма = 0;
    
    Для Каждого Строка Из ТЗДанные Цикл
        СоответствуетФильтру = Истина;
        
        Для Каждого Условие Из УсловияФильтрации Цикл
            Если Строка[Условие.Колонка] <> Условие.Значение Тогда
                СоответствуетФильтру = Ложь;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        Если СоответствуетФильтру Тогда
            ОбщаяСумма = ОбщаяСумма + Строка.Сумма;
        КонецЕсли;
    КонецЦикла;
    
    Возврат ОбщаяСумма;
    
КонецФункции 

&НаКлиенте
Процедура РассчитатьКоличествоУникальныхПациентов()
    ПоказательУникальныеПациенты = ОпределитьПоказатель ("Количество уникальных пациентов");

    // Общее количество уникальных пациентов
    ОбщееКоличествоПациентов = РассчитатьКоличествоУникальныхПациентовПоФильтрам(Новый Массив);
    ДобавитьПоказатель(ПоказательУникальныеПациенты, "Общий", , , , , ОбщееКоличествоПациентов);
    
    // Расчет по организациям
    Организации = ПолучитьУникальныеЗначения("Организация");
    Для Каждого Элемент Из Организации Цикл
        Организация = Элемент.Ключ;
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
        
        КоличествоПациентов = РассчитатьКоличествоУникальныхПациентовПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательУникальныеПациенты, "По организациям", , , Организация, , КоличествоПациентов);
    КонецЦикла;
    
    // Расчет по мед. центрам
    МедЦентры = ПолучитьУникальныеЗначения("МедицинскийЦентр");
    СоответствиеМедЦентрОрганизация = ПолучитьСоответствиеМедЦентрОрганизация();
    
    Для Каждого Элемент Из МедЦентры Цикл
        МедЦентр = Элемент.Ключ;
        Организация = СоответствиеМедЦентрОрганизация.Получить(МедЦентр);
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
        
        КоличествоПациентов = РассчитатьКоличествоУникальныхПациентовПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательУникальныеПациенты, "По мед. центрам", , , Организация, МедЦентр, КоличествоПациентов);
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Функция РассчитатьКоличествоУникальныхПациентовПоФильтрам(УсловияФильтрации)
    
    УникальныеПациенты = Новый Соответствие;
    
    Для Каждого Строка Из ТЗДанные Цикл
        СоответствуетФильтру = Истина;
        
        Для Каждого Условие Из УсловияФильтрации Цикл
            Если Строка[Условие.Колонка] <> Условие.Значение Тогда
                СоответствуетФильтру = Ложь;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        Если СоответствуетФильтру И Строка.Клиент <> Неопределено Тогда
            УникальныеПациенты[Строка.Клиент] = Истина;
        КонецЕсли;
    КонецЦикла;
    
    Возврат УникальныеПациенты.Количество();
    
КонецФункции

&НаКлиенте
Функция РассчитатьКоличествоПосещенийПоФильтрам(УсловияФильтрации)
    
    УникальныеПосещения = Новый Соответствие;
    
    Для Каждого Строка Из ТЗДанные Цикл
        СоответствуетФильтру = Истина;
        
        Для Каждого Условие Из УсловияФильтрации Цикл
            Если Строка[Условие.Колонка] <> Условие.Значение Тогда
                СоответствуетФильтру = Ложь;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        Если СоответствуетФильтру И Строка.Клиент <> Неопределено Тогда
            // Уникальное посещение = клиент + дата (без времени)
            ДатаПосещения = НачалоДня(Строка.Период);
            КлючПосещения = Строка(Строка.Клиент) + "|" + Формат(ДатаПосещения, "ДФ=dd.MM.yyyy");
            УникальныеПосещения[КлючПосещения] = Истина;
        КонецЕсли;
    КонецЦикла;
    
    Возврат УникальныеПосещения.Количество();
    
КонецФункции

&НаКлиенте
Процедура РассчитатьКоличествоПосещений()
    ПоказательКоличествоПосещений = ОпределитьПоказатель ("Количество посещений");
    ОбщееКоличествоПосещений = РассчитатьКоличествоПосещенийПоФильтрам(Новый Массив);
    ДобавитьПоказатель(ПоказательКоличествоПосещений, "Общий", , , , , ОбщееКоличествоПосещений);
    
    // Расчет по организациям
    Организации = ПолучитьУникальныеЗначения("Организация");
    Для Каждого Элемент Из Организации Цикл
        Организация = Элемент.Ключ;
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
        
        КоличествоПосещений = РассчитатьКоличествоПосещенийПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательКоличествоПосещений, "По организациям", , , Организация, , КоличествоПосещений);
    КонецЦикла;
    
    // Расчет по мед. центрам
    МедЦентры = ПолучитьУникальныеЗначения("МедицинскийЦентр");
    СоответствиеМедЦентрОрганизация = ПолучитьСоответствиеМедЦентрОрганизация();
    
    Для Каждого Элемент Из МедЦентры Цикл
        МедЦентр = Элемент.Ключ;
        Организация = СоответствиеМедЦентрОрганизация.Получить(МедЦентр);
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
        
        КоличествоПосещений = РассчитатьКоличествоПосещенийПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательКоличествоПосещений, "По мед. центрам", , , Организация, МедЦентр, КоличествоПосещений);
    КонецЦикла;
    
КонецПроцедуры 

&НаКлиенте
Процедура РассчитатьКоличествоПостоянныхПациентов()
    ПоказательКоличествоПостоянных = ОпределитьПоказатель ("Количество постоянных пациентов");

    // Общее количество постоянных пациентов по всем филиалам
    ОбщееКоличествоПостоянных = РассчитатьКоличествоПостоянныхПациентовПоФильтрам(Новый Массив);
    ДобавитьПоказатель(ПоказательКоличествоПостоянных, "Общий", , , , , ОбщееКоличествоПостоянных);
    
    // Расчет по организациям (филиалам)
    Организации = ПолучитьУникальныеЗначения("Организация");
    Для Каждого Элемент Из Организации Цикл
        Организация = Элемент.Ключ;
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
        
        КоличествоПостоянных = РассчитатьКоличествоПостоянныхПациентовПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательКоличествоПостоянных, "По организациям", , , Организация, , КоличествоПостоянных);
    КонецЦикла;
    
    // Расчет по мед. центрам (филиалам)
    МедЦентры = ПолучитьУникальныеЗначения("МедицинскийЦентр");
    СоответствиеМедЦентрОрганизация = ПолучитьСоответствиеМедЦентрОрганизация();
    
    Для Каждого Элемент Из МедЦентры Цикл
        МедЦентр = Элемент.Ключ;
        Организация = СоответствиеМедЦентрОрганизация.Получить(МедЦентр);
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
        
        КоличествоПостоянных = РассчитатьКоличествоПостоянныхПациентовПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательКоличествоПостоянных, "По мед. центрам", , , Организация, МедЦентр, КоличествоПостоянных);
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Функция РассчитатьКоличествоПостоянныхПациентовПоФильтрам(УсловияФильтрации)
    
    ПостоянныеПациенты = Новый Соответствие;
    
    Для Каждого Строка Из ТЗДанные Цикл
        СоответствуетФильтру = Истина;
        
        // Проверяем все условия фильтрации
        Для Каждого Условие Из УсловияФильтрации Цикл
            Если Строка[Условие.Колонка] <> Условие.Значение Тогда
                СоответствуетФильтру = Ложь;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        Если СоответствуетФильтру И Строка.Клиент <> Неопределено Тогда
            // Получаем текущее значение для клиента
            ТекущееЗначение = ПостоянныеПациенты.Получить(Строка.Клиент);
            
            Если ТекущееЗначение = Неопределено Тогда
                ПостоянныеПациенты[Строка.Клиент] = Строка.ПостоянныйКлиент;
            Иначе
                Если Не ТекущееЗначение И Строка.ПостоянныйКлиент Тогда
                    ПостоянныеПациенты[Строка.Клиент] = Истина;
                КонецЕсли;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
    
    КоличествоПостоянных = 0;
    Для Каждого КлючИЗначение Из ПостоянныеПациенты Цикл
        Если КлючИЗначение.Значение Тогда
            КоличествоПостоянных = КоличествоПостоянных + 1;
        КонецЕсли;
    КонецЦикла;
    
    Возврат КоличествоПостоянных;
    
КонецФункции

&НаКлиенте
Процедура РассчитатьПроцентПовторныхПосещений()
    ПоказательПроцентПовторных = ОпределитьПоказатель("Процент повторных посещений");

    // Общий процент повторных посещений
    ОбщийПроцентПовторных = РассчитатьПроцентПовторныхПосещенийПоФильтрам(Новый Массив);
    ДобавитьПоказатель(ПоказательПроцентПовторных, "Общий", , , , , ОбщийПроцентПовторных);
    
    // Расчет по организациям
    Организации = ПолучитьУникальныеЗначения("Организация");
    Для Каждого Элемент Из Организации Цикл
        Организация = Элемент.Ключ;
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
        
        ПроцентПовторных = РассчитатьПроцентПовторныхПосещенийПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательПроцентПовторных, "По организациям", , , Организация, , ПроцентПовторных);
    КонецЦикла;
    
    // Расчет по мед. центрам
    МедЦентры = ПолучитьУникальныеЗначения("МедицинскийЦентр");
    СоответствиеМедЦентрОрганизация = ПолучитьСоответствиеМедЦентрОрганизация();
    
    Для Каждого Элемент Из МедЦентры Цикл
        МедЦентр = Элемент.Ключ;
        Организация = СоответствиеМедЦентрОрганизация.Получить(МедЦентр);
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
        
        ПроцентПовторных = РассчитатьПроцентПовторныхПосещенийПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательПроцентПовторных, "По мед. центрам", , , Организация, МедЦентр, ПроцентПовторных);
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция РассчитатьПроцентПовторныхПосещенийПоФильтрам(УсловияФильтрации)
    
    УникальныеПосещенияПоПациентам = Новый Соответствие;
    
    Для Каждого Строка Из ТЗДанные Цикл
        СоответствуетФильтру = Истина;
        
        Для Каждого Условие Из УсловияФильтрации Цикл
            Если Строка[Условие.Колонка] <> Условие.Значение Тогда
                СоответствуетФильтру = Ложь;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        Если СоответствуетФильтру И Строка.Клиент <> Неопределено Тогда
            ДатаПосещения = НачалоДня(Строка.Период);
            КлючПосещения = Строка(Строка.Клиент) + "|" + Формат(ДатаПосещения, "ДФ=dd.MM.yyyy");
            
            ПосещенияПациента = УникальныеПосещенияПоПациентам.Получить(Строка.Клиент);
            Если ПосещенияПациента = Неопределено Тогда
                ПосещенияПациента = Новый Соответствие;
                УникальныеПосещенияПоПациентам.Вставить(Строка.Клиент, ПосещенияПациента);
            КонецЕсли;
            
            ПосещенияПациента.Вставить(КлючПосещения, Истина);
        КонецЕсли;
    КонецЦикла;
    
    КоличествоПациентовСПовторными = 0;
    ОбщееКоличествоПациентов = УникальныеПосещенияПоПациентам.Количество();
    
    Если ОбщееКоличествоПациентов > 0 Тогда
        Для Каждого КлючИЗначение Из УникальныеПосещенияПоПациентам Цикл
            КоличествоУникальныхДней = КлючИЗначение.Значение.Количество();
            Если КоличествоУникальныхДней > 1 Тогда
                КоличествоПациентовСПовторными = КоличествоПациентовСПовторными + 1;
            КонецЕсли;
        КонецЦикла;
        
        Возврат (КоличествоПациентовСПовторными / ОбщееКоличествоПациентов) * 100;
    Иначе
        Возврат 0;
    КонецЕсли;
    
КонецФункции
&НаКлиенте
Процедура РассчитатьПроцентПостоянныхКлиентов()
    ПоказательПроцентПостоянных = ОпределитьПоказатель("Процент постоянных клиентов");

    // Общий процент постоянных клиентов
    ОбщийПроцентПостоянных = РассчитатьПроцентПостоянныхКлиентовПоФильтрам(Новый Массив);
    ДобавитьПоказатель(ПоказательПроцентПостоянных, "Общий", , , , , ОбщийПроцентПостоянных);
    
    // Расчет по организациям
    Организации = ПолучитьУникальныеЗначения("Организация");
    Для Каждого Элемент Из Организации Цикл
        Организация = Элемент.Ключ;
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
        
        ПроцентПостоянных = РассчитатьПроцентПостоянныхКлиентовПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательПроцентПостоянных, "По организациям", , , Организация, , ПроцентПостоянных);
    КонецЦикла;
    
    // Расчет по мед. центрам
    МедЦентры = ПолучитьУникальныеЗначения("МедицинскийЦентр");
    СоответствиеМедЦентрОрганизация = ПолучитьСоответствиеМедЦентрОрганизация();
    
    Для Каждого Элемент Из МедЦентры Цикл
        МедЦентр = Элемент.Ключ;
        Организация = СоответствиеМедЦентрОрганизация.Получить(МедЦентр);
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
        
        ПроцентПостоянных = РассчитатьПроцентПостоянныхКлиентовПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательПроцентПостоянных, "По мед. центрам", , , Организация, МедЦентр, ПроцентПостоянных);
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция РассчитатьПроцентПостоянныхКлиентовПоФильтрам(УсловияФильтрации)
    
    УникальныеПациенты = Новый Соответствие;
    ПостоянныеПациенты = Новый Соответствие;
    
    Для Каждого Строка Из ТЗДанные Цикл
        СоответствуетФильтру = Истина;
        
        Для Каждого Условие Из УсловияФильтрации Цикл
            Если Строка[Условие.Колонка] <> Условие.Значение Тогда
                СоответствуетФильтру = Ложь;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        Если СоответствуетФильтру И Строка.Клиент <> Неопределено Тогда
            УникальныеПациенты[Строка.Клиент] = Истина;
            
            Если Строка.ПостоянныйКлиент Тогда
                ПостоянныеПациенты[Строка.Клиент] = Истина;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
    
    ОбщееКоличествоПациентов = УникальныеПациенты.Количество();
    КоличествоПостоянных = ПостоянныеПациенты.Количество();
    
    Если ОбщееКоличествоПациентов > 0 Тогда
        Возврат (КоличествоПостоянных / ОбщееКоличествоПациентов) * 100;
    Иначе
        Возврат 0;
    КонецЕсли;
    
КонецФункции

&НаКлиенте
Процедура РассчитатьКоличествоПриемов()
    ПоказательПервичные = ОпределитьПоказатель("Количество первичных приемов");
    ПоказательПовторные = ОпределитьПоказатель("Количество повторных приемов");

    // Общее количество приемов
    ОбщееКоличествоПриемов = РассчитатьКоличествоПриемовПоФильтрам(Новый Массив);
    ДобавитьПоказатель(ПоказательПервичные, "Общий", , , , , ОбщееКоличествоПриемов.Первичные);
    ДобавитьПоказатель(ПоказательПовторные, "Общий", , , , , ОбщееКоличествоПриемов.Повторные);
    
    // Расчет по организациям
    Организации = ПолучитьУникальныеЗначения("Организация");
    Для Каждого Элемент Из Организации Цикл
        Организация = Элемент.Ключ;
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
        
        КоличествоПриемов = РассчитатьКоличествоПриемовПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательПервичные, "По организациям", , , Организация, , КоличествоПриемов.Первичные);
        ДобавитьПоказатель(ПоказательПовторные, "По организациям", , , Организация, , КоличествоПриемов.Повторные);
    КонецЦикла;
    
    // Расчет по мед. центрам
    МедЦентры = ПолучитьУникальныеЗначения("МедицинскийЦентр");
    СоответствиеМедЦентрОрганизация = ПолучитьСоответствиеМедЦентрОрганизация();
    
    Для Каждого Элемент Из МедЦентры Цикл
        МедЦентр = Элемент.Ключ;
        Организация = СоответствиеМедЦентрОрганизация.Получить(МедЦентр);
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
        
        КоличествоПриемов = РассчитатьКоличествоПриемовПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательПервичные, "По мед. центрам", , , Организация, МедЦентр, КоличествоПриемов.Первичные);
        ДобавитьПоказатель(ПоказательПовторные, "По мед. центрам", , , Организация, МедЦентр, КоличествоПриемов.Повторные);
    КонецЦикла;
КонецПроцедуры

&НаСервере
Функция РассчитатьКоличествоПриемовПоФильтрам(УсловияФильтрации)
    
    ПериодС = Период;
    ПериодПо = КонецМесяца(Период);
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Прием.ЭтоПервичный,
    |    КОЛИЧЕСТВО(Прием.Ссылка) КАК КоличествоПриемов
    |ИЗ
    |    Документ.Прием КАК Прием
    |        ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
    |        ПО Прием.ДокументОснование = Заявка.Ссылка
    |        ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Филиалы КАК Филиалы
    |        ПО Прием.Филиал = Филиалы.Ссылка
    |ГДЕ
    |    Прием.Проведен = Истина
    |    И Прием.ПометкаУдаления = Ложь
    |    И Прием.Дата МЕЖДУ &ПериодС И &ПериодПо
    |    И Заявка.Состояние В (&МассивСостоянийЗаявок)";
    
    Если УсловияФильтрации.Количество() > 0 Тогда
        Запрос.Текст = Запрос.Текст + "
        |    // Условия фильтрации";
        
        Для Каждого Условие Из УсловияФильтрации Цикл
            Если Условие.Колонка = "Организация" Тогда
                Запрос.Текст = Запрос.Текст + "
                |    И Филиалы.Организация = &Организация";
                Запрос.УстановитьПараметр("Организация", Условие.Значение);
            ИначеЕсли Условие.Колонка = "МедицинскийЦентр" Тогда
                Запрос.Текст = Запрос.Текст + "
                |    И Прием.Филиал = &МедицинскийЦентр";
                Запрос.УстановитьПараметр("МедицинскийЦентр", Условие.Значение);
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;
    
    Запрос.Текст = Запрос.Текст + "
    |СГРУППИРОВАТЬ ПО
    |    Прием.ЭтоПервичный";
    
    МассивСостоянийЗаявок = Новый Массив;
    МассивСостоянийЗаявок.Добавить(Справочники.ВидыСостоянийЗаявок.Выполнена);
    МассивСостоянийЗаявок.Добавить(Справочники.ВидыСостоянийЗаявок.Оплачена);
    МассивСостоянийЗаявок.Добавить(Справочники.ВидыСостоянийЗаявок.Прием);
    
    Запрос.УстановитьПараметр("ПериодС", ПериодС);
    Запрос.УстановитьПараметр("ПериодПо", ПериодПо);
    Запрос.УстановитьПараметр("МассивСостоянийЗаявок", МассивСостоянийЗаявок);

    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Первичные = 0;
    Повторные = 0;
    
    Пока Выборка.Следующий() Цикл
        Если Выборка.ЭтоПервичный Тогда
            Первичные = Первичные + Выборка.КоличествоПриемов;
        Иначе
            Повторные = Повторные + Выборка.КоличествоПриемов;
        КонецЕсли;
    КонецЦикла;
    
    РезультатРасчета = Новый Структура;
    РезультатРасчета.Вставить("Первичные", Первичные);
    РезультатРасчета.Вставить("Повторные", Повторные);
    
    Возврат РезультатРасчета;
    
КонецФункции

&НаКлиенте
Процедура РассчитатьКоличествоНовыхКлиентов()
    ПоказательНовыеКлиенты = ОпределитьПоказатель("Количество новых клиентов");

    // Общее количество новых клиентов
    ОбщееКоличествоНовых = РассчитатьКоличествоНовыхКлиентовПоФильтрам(Новый Массив);
    ДобавитьПоказатель(ПоказательНовыеКлиенты, "Общий", , , , , ОбщееКоличествоНовых);
    
    // Расчет по организациям
    Организации = ПолучитьУникальныеЗначения("Организация");
    Для Каждого Элемент Из Организации Цикл
        Организация = Элемент.Ключ;
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "Организация", Организация));
        
        КоличествоНовых = РассчитатьКоличествоНовыхКлиентовПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательНовыеКлиенты, "По организациям", , , Организация, , КоличествоНовых);
    КонецЦикла;
    
    // Расчет по мед. центрам
    МедЦентры = ПолучитьУникальныеЗначения("МедицинскийЦентр");
    СоответствиеМедЦентрОрганизация = ПолучитьСоответствиеМедЦентрОрганизация();
    
    Для Каждого Элемент Из МедЦентры Цикл
        МедЦентр = Элемент.Ключ;
        Организация = СоответствиеМедЦентрОрганизация.Получить(МедЦентр);
        
        Фильтр = Новый Массив;
        Фильтр.Добавить(Новый Структура("Колонка, Значение", "МедицинскийЦентр", МедЦентр));
        
        КоличествоНовых = РассчитатьКоличествоНовыхКлиентовПоФильтрам(Фильтр);
        ДобавитьПоказатель(ПоказательНовыеКлиенты, "По мед. центрам", , , Организация, МедЦентр, КоличествоНовых);
    КонецЦикла;
КонецПроцедуры 


&НаСервере
Функция РассчитатьКоличествоНовыхКлиентовПоФильтрам(УсловияФильтрации)
    
    ПериодС = Период;
    ПериодПо = КонецМесяца(Период);
    
    КлиентыТекущегоПериода = Новый Соответствие;
    
    Для Каждого Строка Из ТЗДанные Цикл
        СоответствуетФильтру = Истина;
        
        Для Каждого Условие Из УсловияФильтрации Цикл
            Если Строка[Условие.Колонка] <> Условие.Значение Тогда
                СоответствуетФильтру = Ложь;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        Если СоответствуетФильтру И Строка.Клиент <> Неопределено Тогда
            КлиентыТекущегоПериода[Строка.Клиент] = Истина;
        КонецЕсли;
    КонецЦикла;
    
    Если КлиентыТекущегоПериода.Количество() = 0 Тогда
        Возврат 0;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗЛИЧНЫЕ
    |    Продажи.Клиент
    |ИЗ
    |    РегистрНакопления.Продажи КАК Продажи
    |ГДЕ
    |    Продажи.Период < &ПериодС
    |    И Продажи.Клиент В (&СписокКлиентов)
    |    И Продажи.Регистратор.СостояниеЧековККМ <> &СостояниеНЕПробиты";
    
    МассивКлиентов = Новый Массив;
    Для Каждого Элемент Из КлиентыТекущегоПериода Цикл
        МассивКлиентов.Добавить(Элемент.Ключ);
    КонецЦикла;
    
    Запрос.УстановитьПараметр("ПериодС", ПериодС);
    Запрос.УстановитьПараметр("СписокКлиентов", МассивКлиентов);
    Запрос.УстановитьПараметр("СостояниеНЕПробиты", Перечисления.СостоянияЧековККМ.ЧекиНеПробиты);

    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    КлиентыИзПрошлыхПериодов = Новый Соответствие;
    Пока Выборка.Следующий() Цикл
        КлиентыИзПрошлыхПериодов[Выборка.Клиент] = Истина;
    КонецЦикла;
    
    КоличествоНовыхКлиентов = 0;
    Для Каждого Элемент Из КлиентыТекущегоПериода Цикл
        Если КлиентыИзПрошлыхПериодов.Получить(Элемент.Ключ) = Неопределено Тогда
            КоличествоНовыхКлиентов = КоличествоНовыхКлиентов + 1;
        КонецЕсли;
    КонецЦикла;
    
    Возврат КоличествоНовыхКлиентов;
    
КонецФункции
&НаКлиенте
Функция ПолучитьУникальныеЗначения(ИмяКолонки)
	
	УникальныеЗначения = Новый Соответствие;
	
	Для Каждого Строка Из ТЗДанные Цикл
		Значение = Строка[ИмяКолонки];
		Если Значение <> Неопределено Тогда
			УникальныеЗначения[Значение] = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат УникальныеЗначения;
	
КонецФункции 



&НаКлиенте
Процедура ДобавитьПоказатель(Показатель, Разрез, ТипУслуги = Неопределено, ТипОплаты = Неопределено, 
	Организация = Неопределено, МедицинскийЦентр = Неопределено, Значение = 0)
	
	НоваяСтрока = ТЗПоказатели.Добавить();
	НоваяСтрока.Показатель = Показатель;
	НоваяСтрока.Разрез = Разрез;
	НоваяСтрока.ТипУслуги = ТипУслуги;
	НоваяСтрока.ТипОплаты = ТипОплаты;
	НоваяСтрока.Организация = Организация;
	НоваяСтрока.МедицинскийЦентр = МедицинскийЦентр;
	НоваяСтрока.Значение = Значение;
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьСоответствиеМедЦентрОрганизация()
	
	Соответствие = Новый Соответствие;
	
	Для Каждого Строка Из ТЗДанные Цикл
		Если Строка.МедицинскийЦентр <> Неопределено И Строка.Организация <> Неопределено Тогда
			Если Соответствие.Получить(Строка.МедицинскийЦентр) = Неопределено Тогда
				Соответствие.Вставить(Строка.МедицинскийЦентр, Строка.Организация);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Соответствие;    
КонецФункции


&НаСервере
Процедура ЗаписатьПоказателиНаСервере()
	НаборЗаписей = РегистрыСведений.омг_ПоказателиДляМонитораРуководителя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	//НаборЗаписей.Прочитать();
	Для Каждого СтрокаПоказателя Из ТЗПоказатели Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Период;
        НоваяЗапись.Показатель = СтрокаПоказателя.Показатель;
        НоваяЗапись.Разрез = СтрокаПоказателя.Разрез;
        НоваяЗапись.ТипУслуги = СтрокаПоказателя.ТипУслуги;
        НоваяЗапись.ТипОплаты = СтрокаПоказателя.ТипОплаты;
        НоваяЗапись.Организация = СтрокаПоказателя.Организация;
        НоваяЗапись.МедицинскийЦентр = СтрокаПоказателя.МедицинскийЦентр;
        НоваяЗапись.Значение = СтрокаПоказателя.Значение;
		
	КонецЦикла;
	НаборЗаписей.Записать();	
	КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПоказатели(Команда)
	ЗаписатьПоказателиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВсеДействия(Команда)
	ОбновитьДанные();
	ТЗПоказатели.Очистить();
	РассчитатьСредниеЧеки();
	РассчитатьДоходы();
	РассчитатьКоличествоУникальныхПациентов();  
	РассчитатьКоличествоПосещений();
	РассчитатьКоличествоПостоянныхПациентов();
	РассчитатьПроцентПовторныхПосещений();        
    РассчитатьПроцентПостоянныхКлиентов();
	РассчитатьКоличествоПриемов();
	РассчитатьКоличествоНовыхКлиентов();
	ЗаписатьПоказателиНаСервере();
	
КонецПроцедуры
